Tekla.Structures.ModelInternal.PourBreak.#ctor
Creates a new pour break instance.
The default values are as follows:
PolygonArray = new ArrayList();

Tekla.Structures.ModelInternal.PourBreak.#ctor(System.Collections.ArrayList)
Creates a new pour break instance and initializes it with given geometry.
See "public ArrayList PolygonArray" for more information about the format.

Tekla.Structures.ModelInternal.PourBreak.PolygonArray
Array of Polygons that form the pour break geometry. One line in the array
is one polygon with all of its points.
Example of format:
ArrayList of ArrayList of points
[0] 0.0, 100.0, 200.0      300.0, 400.0, 500.0      800.0, 900.0, 1000.0
[1] 0.0, 600.0, 200.0      100.0, 900.0, 200.0      550.0, 800.0, 2000.0    ...
[2] ...